sfthkr/FreeRTOS-tm4c123g-RTBN-Lab4/Lab4/Lab4.c
#include <stdint.h>
#include "tm4c123gh6pm.h"
/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "semphr.h"
#include "queue.h"

#include "BSP.h"
#include "Profile.h"
#include "Texas.h" 
#include "CortexM.h"
#include "PLL.h"


uint32_t sqrt32(uint32_t s);
void OS_EdgeTrigger_Restart(void);
void GPIOPortD_Handler(void);
void RealTimeEvents(void);
void OS_EdgeTrigger_Init(uint8_t priority);

//---------------- Global variables shared between tasks ----------------
uint32_t Time;              // elasped time in 100 ms units
uint32_t Steps;             // number of steps counted
uint32_t Magnitude;         // will not overflow (3*1,023^2 = 3,139,587)
                            // Exponentially Weighted Moving Average
uint32_t EWMA;              // https://en.wikipedia.org/wiki/Moving_average#Exponential_moving_average
uint16_t SoundData;         // raw data sampled from the microphone
int32_t SoundAvg;

uint32_t SoundRMS;          // Root Mean Square average of most recent sound samples
uint32_t LightData;         // 100 lux
int32_t TemperatureData;    // 0.1C

// semaphores
xSemaphoreHandle NewData = NULL;		// true when new numbers to display on top of LCD
xSemaphoreHandle LCDmutex = NULL;		// exclusive access to LCD
xSemaphoreHandle I2Cmutex = NULL;		// exclusive access to I2C
xSemaphoreHandle TakeSoundData = NULL;	// binary semaphore
xSemaphoreHandle ADCmutex = NULL;	// access to ADC
xSemaphoreHandle TakeAccelerationData = NULL;	
xSemaphoreHandle SwitchTouch = NULL;

xQueueHandle accDataQueue = NULL;


int ReDrawAxes = 0;         // non-zero means redraw axes on next display task

enum plotstate{
  Accelerometer,
  Microphone,
  Temperature,
  Light
};
enum plotstate PlotState = Accelerometer;
//color constants
#define BGCOLOR     LCD_BLACK
#define AXISCOLOR   LCD_ORANGE
#define MAGCOLOR    LCD_YELLOW
#define EWMACOLOR   LCD_CYAN
#define SOUNDCOLOR  LCD_CYAN
#define LIGHTCOLOR  LCD_RED
#define TEMPCOLOR   LCD_LIGHTGREEN
#define TOPTXTCOLOR LCD_WHITE
#define TOPNUMCOLOR LCD_ORANGE
//------------ end of Global variables shared between tasks -------------

//---------------- Task0 samples sound from microphone ----------------
// High priority thread run by OS in real time at 1000 Hz
#define SOUNDRMSLENGTH 1000 // number of samples to collect before calculating RMS (may overflow if greater than 4104)
int16_t SoundArray[SOUNDRMSLENGTH];

// *********Task0*********
// Task0 measures sound intensity
// Periodic main thread runs in real time at 1000 Hz
// collects data from microphone, high priority
// Inputs:  none
// Outputs: none
void Task0(void *p)
{ 
  static int32_t soundSum = 0;
  static int time = 0;// units of microphone sampling rate
  SoundRMS = 0;
  while(1){
    xSemaphoreTake(TakeSoundData, (TickType_t)portMAX_DELAY);	// signaled by OS every 1ms
    
		TExaS_Task0();     // record system time in array, toggle virtual logic analyzer
    Profile_Toggle0(); // viewed by the logic analyzer to know Task0 started

		xSemaphoreTake(ADCmutex, (TickType_t)portMAX_DELAY);	// signaled by OS every 1ms
    BSP_Microphone_Input(&SoundData);
    xSemaphoreGive(ADCmutex);
		soundSum = soundSum + (int32_t)SoundData;
    SoundArray[time] = SoundData;
    time = time + 1;
    if(time == SOUNDRMSLENGTH)
		{
      SoundAvg = soundSum/SOUNDRMSLENGTH;
      soundSum = 0;
      xSemaphoreGive(NewData);
			time = 0;
    }
		
  }
}
/* ****************************************** */
/*          End of Task0 Section              */
/* ****************************************** */

//---------------- Task1 measures acceleration ----------------
// Event thread run by OS in real time at 10 Hz
uint32_t LostTask1Data;     // number of times that the FIFO was full when acceleration data was ready
uint16_t AccX, AccY, AccZ;  // returned by BSP as 10-bit numbers
#define ALPHA 128           // The degree of weighting decrease, a constant smoothing factor between 0 and 1,023. A higher ALPHA discounts older observations faster.
                            // basic step counting algorithm is based on a forum post from
                            // http://stackoverflow.com/questions/16392142/android-accelerometer-profiling/16539643#16539643
enum state{                 // the step counting algorithm cycles through four states
  LookingForMax,            // looking for a local maximum in current magnitude
  LookingForCross1,         // looking for current magnitude to cross average magnitude, minus a constant
  LookingForMin,            // looking for a local minimum in current magnitude
  LookingForCross2          // looking for current magnitude to cross average magnitude, plus a constant
};
enum state AlgorithmState = LookingForMax;
#define LOCALCOUNTTARGET 5  // The number of valid measured magnitudes needed to confirm a local min or local max.  Increase this number for longer strides or more frequent measurements.
#define AVGOVERSHOOT 25     // The amount above or below average a measurement must be to count as "crossing" the average.  Increase this number to reject increasingly hard shaking as steps.
// *********Task1*********
// Task1 collects data from accelerometer in real time
// Periodic main thread runs in real time at 10 Hz
// Inputs:  none
// Outputs: none
void Task1(void *p)
{ 
	uint32_t squared;
  // initialize the exponential weighted moving average filter
  BSP_Accelerometer_Input(&AccX, &AccY, &AccZ);
  Magnitude = sqrt32(AccX*AccX + AccY*AccY + AccZ*AccZ);
  EWMA = Magnitude;                // this is a guess; there are many options
  Steps = 0;
  LostTask1Data = 0;
  while(1)
	{
    xSemaphoreTake(TakeAccelerationData, (TickType_t)portMAX_DELAY); // signaled by OS every 100ms
    
		TExaS_Task1();     // records system time in array, toggles virtual logic analyzer
    Profile_Toggle1(); // viewed by the logic analyzer to know Task1 started

		xSemaphoreTake(ADCmutex, (TickType_t)portMAX_DELAY);
    BSP_Accelerometer_Input(&AccX, &AccY, &AccZ);
		xSemaphoreGive(ADCmutex);
    squared = AccX*AccX + AccY*AccY + AccZ*AccZ;
    if(xQueueSend(accDataQueue, &squared, 500) == -1){  // makes Task2 run every 100ms
      //LostTask1Data = LostTask1Data + 1;
    }
		
    Time++; // in 100ms units
				
