sfthkr/FreeRTOS-tm4c123g-RTBN-Lab4/Lab4/Lab4.c
// *********Task5*********
// Main thread scheduled by OS round robin preemptive scheduler
// updates the text at the top and bottom of the LCD
// Inputs:  none
// Outputs: none
void Task5(void *p)
{
	int32_t soundSum;
  xSemaphoreTake(LCDmutex, (TickType_t)portMAX_DELAY);
  BSP_LCD_DrawString(0,  0, "Temp=",  TOPTXTCOLOR);
  BSP_LCD_DrawString(0,  1, "Step=",  TOPTXTCOLOR);
  BSP_LCD_DrawString(10, 0, "Light=", TOPTXTCOLOR);
  BSP_LCD_DrawString(10, 1, "Sound=", TOPTXTCOLOR);
	xSemaphoreGive(LCDmutex);
  while(1){
		xSemaphoreTake(NewData, (TickType_t)portMAX_DELAY);
    
		TExaS_Task5();     // records system time in array, toggles virtual logic analyzer
    Profile_Toggle5(); // viewed by the logic analyzer to know Task5 started

		soundSum = 0;
    for(int i=0; i<SOUNDRMSLENGTH; i=i+1){
      soundSum = soundSum + (SoundArray[i] - SoundAvg)*(SoundArray[i] - SoundAvg);
    }
    SoundRMS = sqrt32(soundSum/SOUNDRMSLENGTH);
    xSemaphoreTake(LCDmutex, (TickType_t)portMAX_DELAY);
		BSP_LCD_SetCursor(5,  0); BSP_LCD_OutUFix2_1(TemperatureData, TEMPCOLOR);
    BSP_LCD_SetCursor(5,  1); BSP_LCD_OutUDec4(Steps,             MAGCOLOR);
    BSP_LCD_SetCursor(16, 0); BSP_LCD_OutUDec4(LightData,         LIGHTCOLOR);
    BSP_LCD_SetCursor(16, 1); BSP_LCD_OutUDec4(SoundRMS,          SOUNDCOLOR);
    BSP_LCD_SetCursor(16,12); BSP_LCD_OutUDec4(Time/10,           TOPNUMCOLOR);
//debug code
    if(LostTask1Data){
      BSP_LCD_SetCursor(0, 12); BSP_LCD_OutUDec4(LostTask1Data, BSP_LCD_Color565(255, 0, 0));
    }
//end of debug code
		xSemaphoreGive(LCDmutex);
  }
}
/* ****************************************** */
/*          End of Task5 Section              */
/* ****************************************** */

//---------------- Task6 measures light ----------------
// *********Task6*********
// Main thread scheduled by OS round robin preemptive scheduler
// Task6 measures light intensity
// Inputs:  none
// Outputs: none
void Task6(void *p)
{ 
	uint32_t lightData;
  int done;
	TickType_t xLastWakeTime = xTaskGetTickCount();
  while(1){
		TExaS_Task6();     // records system time in array, toggles virtual logic analyzer
    Profile_Toggle6(); // viewed by the logic analyzer to know Task6 started

		xSemaphoreTake(I2Cmutex, (TickType_t)portMAX_DELAY);
    BSP_LightSensor_Start();
		xSemaphoreGive(I2Cmutex);
    done = 0;
		//vTaskDelayUntil(&xLastWakeTime, 800/portTICK_RATE_MS);
		vTaskDelay(800/portTICK_RATE_MS);
    while(done == 0){
			xSemaphoreTake(I2Cmutex, (TickType_t)portMAX_DELAY);
      done = BSP_LightSensor_End(&lightData);
      xSemaphoreGive(I2Cmutex);
    }
    LightData = lightData/100;
  }
}
/* ****************************************** */
/*          End of Task6 Section              */
/* ****************************************** */

//---------------- Task7 dummy function ----------------
// *********Task7*********
// Main thread scheduled by OS round robin preemptive scheduler
// Task7 does nothing but never blocks or sleeps
// Inputs:  none
// Outputs: none
uint32_t Count7;
void Task7(void *p){
  Count7 = 0;
  while(1){
    Count7++;
    WaitForInterrupt();
  }
}
/* ****************************************** */
/*          End of Task7 Section              */
/* ****************************************** */




int main(void)
{ 
	BSP_Clock_InitFastest();
	DisableInterrupts();
	Profile_Init();  // initialize the 7 hardware profiling pins

	BSP_Button1_Init();
  BSP_Button2_Init();
  BSP_RGB_Init(0, 0, 0);
  BSP_Buzzer_Init(0);
  BSP_LCD_Init();
  BSP_LCD_FillScreen(BSP_LCD_Color565(0, 0, 0));
  BSP_LightSensor_Init();
  BSP_TempSensor_Init();
  Time = 0;

	NewData = xSemaphoreCreateBinary();
	TakeSoundData = xSemaphoreCreateBinary();
	ADCmutex = xSemaphoreCreateMutex();
	TakeAccelerationData = xSemaphoreCreateBinary();
	SwitchTouch = xSemaphoreCreateBinary();
	LCDmutex = xSemaphoreCreateMutex();
	I2Cmutex = xSemaphoreCreateMutex();
	
	xSemaphoreGive(SwitchTouch);
	xSemaphoreGive(NewData);
	xSemaphoreGive(TakeSoundData);
	xSemaphoreGive(ADCmutex);
	xSemaphoreGive(TakeAccelerationData);
	xSemaphoreGive(LCDmutex);
	xSemaphoreGive(I2Cmutex);
	
	accDataQueue = xQueueCreate(30, sizeof( unsigned long ) );
	
  BSP_Microphone_Init();
  BSP_Accelerometer_Init();
		
	xTaskCreate(Task0, (const char*) "microphone", 128, NULL, 4, NULL);
	xTaskCreate(Task1, (const char*) "acceleration", 128, NULL, 3, NULL);
	xTaskCreate(Task2, (const char*) "LCD", 128, NULL, 2, NULL);
	xTaskCreate(Task3, (const char*) "switchbuzzer", 128, NULL, 1, NULL);
	xTaskCreate(Task4, (const char*) "temperature", 128, NULL, 1, NULL);
	xTaskCreate(Task5, (const char*) "LCD", 128, NULL, 1, NULL);
	xTaskCreate(Task6, (const char*) "light", 128, NULL, 1, NULL);
	xTaskCreate(Task7, (const char*) "dummy", 128, NULL, 0, NULL);
	
	BSP_PeriodicTask_InitC(&RealTimeEvents, 1000, 0);

	TExaS_Init(LOGICANALYZER, 1000);
	EnableInterrupts();
	//Start RTOS scheduler
  vTaskStartScheduler();

	return 0;
}

// *****periodic events****************
void RealTimeEvents(void)
{
	static signed portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
	//long taskVoken1;
	//long taskVoken2;
	
	int flag=0;
  static int32_t realCount = -10; // let all the threads execute once
  // Note to students: we had to let the system run for a time so all user threads ran at least one
  // before signalling the periodic tasks
  realCount++;
  if(realCount >= 0){
		if((realCount%1)==0){
			xSemaphoreGiveFromISR(TakeSoundData, &xHigherPriorityTaskWoken);
			//portYIELD_FROM_ISR(taskVoken1);
      //xSemaphoreGive(TakeSoundData);
      flag = 1;
		}
    if((realCount%100)==0){
			xSemaphoreGiveFromISR(TakeAccelerationData, &xHigherPriorityTaskWoken);
			//portYIELD_FROM_ISR(taskVoken2);
      //xSemaphoreGive(TakeAccelerationData);
      flag=1;
		}
    if(flag){
    }
		portYIELD_FROM_ISR(xHigherPriorityTaskWoken);

  }
}

//****edge-triggered event************
void OS_EdgeTrigger_Init(uint8_t priority)
{
	SYSCTL_RCGCGPIO_R |= 0x08;			// 1) activate clock for Port D
	while((SYSCTL_PRGPIO_R&0x08) == 0){};			
																	// allow time for clock to stabilize
																	// 2) no need to unlock PD6
	GPIO_PORTD_AMSEL_R &= ~0x40;	  // 3) disable analog on PD6
	GPIO_PORTD_PCTL_R =	(GPIO_PORTD_PCTL_R&0xF0FFFFFF)+00000000;
																	// 4) configure PD6 as GPIO
	GPIO_PORTD_DIR_R	&= ~0x40;			// 5) make PD6 input
	GPIO_PORTD_AFSEL_R &= ~0x40;		// 6) disable alt funct on PD6
	GPIO_PORTD_PUR_R &=	~0x40;			// disable pull-up on PD6
	GPIO_PORTD_DEN_R	|=	0x40;			// 7) enable digital I/O on PD6  
	GPIO_PORTD_IS_R &=	~0x40;			// (d) PD6 is edge-sensitive 
	GPIO_PORTD_IBE_R	&=	~0x40;		//     PD6 is not both edges 
	GPIO_PORTD_IEV_R	&=	~0x40;		//     PD6 is falling edge event 
	GPIO_PORTD_ICR_R	=	0x40;				// (e) clear PD6 flag
	GPIO_PORTD_IM_R	|=	0x40;				// (f) arm interrupt on PD6
	NVIC_PRI0_R	=	(NVIC_PRI0_R&0x1FFFFFFF)|(priority << 29);
																	// priority on Port D edge trigger is NVIC_PRI0_R	31 – 29
	NVIC_EN0_R	=	0x00000008;				// enable is bit 3 in NVIC_EN0_R
 }

void OS_EdgeTrigger_Restart(void){
//***IMPLEMENT THIS***
	GPIO_PORTD_IM_R	|=	0x40;		// rearm interrupt 3 in NVIC
	GPIO_PORTD_ICR_R	=	0x40;		// clear flag6
}

void GPIOPortD_Handler(void)
{
	static signed portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
	if(GPIO_PORTD_RIS_R & 0x40){
		GPIO_PORTD_ICR_R	=	0x40;			// step 1 acknowledge by clearing flag
		
		xSemaphoreGiveFromISR(SwitchTouch, &xHigherPriorityTaskWoken);
		portYIELD_FROM_ISR(xHigherPriorityTaskWoken);

		GPIO_PORTD_IM_R	&=	~0x40;		// step 3 disarm interrupt to prevent bouncing to create multiple signals
	}
}	


