sfthkr/FreeRTOS-tm4c123g-RTBN-Lab4/Lab4/Lab4.c
uint32_t sqrt32(uint32_t s){
uint32_t t;   // t*t will become s
int n;             // loop counter
  t = s/16+1;      // initial guess
  for(n = 16; n; --n){ // will finish
    t = ((t*t+s)/t)/2;
  }
  return t;
}
















//---------------- Step 1 ----------------
// Step 1 is to extend OS_AddThreads from Lab 4 to handle eight
// main threads, add a status field to the TCB, and rewrite
// the scheduler to handle priority.
// Task   Type           When to Run
// TaskA  data producer  periodically every 20 ms (sleep)
// TaskB  data consumer  after TaskA finishes
// TaskC  data producer  periodically every 50 ms (sleep)
// TaskD  data consumer  after TaskC finishes
// TaskE  data producer  periodically every 100 ms (sleep)
// TaskF  data consumer  after TaskE finishes
// TaskG  low level task, runs a lot
// TaskH  low level task, never runs
// Remember that you must have exactly one main() function, so
// to work on this step, you must rename all other main()
// functions in this file.
xSemaphoreHandle sAB = NULL;		// true when new numbers to display on top of LCD
xSemaphoreHandle sCD = NULL;		// true when new numbers to display on top of LCD
xSemaphoreHandle sEF = NULL;		// true when new numbers to display on top of LCD


int32_t CountA,CountB,CountC,CountD,CountE,CountF,CountG,CountH;
void TaskA(void *p){ // producer highest priority
  CountA = 0;
	TickType_t xLastWakeTimeA = xTaskGetTickCount();
  while(1){
		xSemaphoreTake(TakeSoundData, (TickType_t)portMAX_DELAY);
    CountA++;
    TExaS_Task0();
    Profile_Toggle0();
		xSemaphoreGive(sAB);
    //OS_Sleep(20);  
		//vTaskDelayUntil(&xLastWakeTimeA, 20/portTICK_RATE_MS);
  }
}
void TaskB(void *p){ // consumer
  CountB = 0;
  while(1){
    CountB++;
		xSemaphoreTake(sAB, (TickType_t)portMAX_DELAY);
    TExaS_Task1();
    Profile_Toggle1();
  }
}
void TaskC(void *p){ // producer
  CountC = 0;
  TickType_t xLastWakeTimeC = xTaskGetTickCount();
  while(1){
		xSemaphoreTake(TakeAccelerationData, (TickType_t)portMAX_DELAY);
    CountC++;
    TExaS_Task2();
    Profile_Toggle2();
		xSemaphoreGive(sCD);
    //OS_Sleep(50);   
		//vTaskDelayUntil(&xLastWakeTimeC, 50/portTICK_RATE_MS);		
  }
}
void TaskD(void *p){ // consumer
  CountD = 0;
  while(1){
    CountD++;
    xSemaphoreTake(sCD, (TickType_t)portMAX_DELAY);
    TExaS_Task3();
    Profile_Toggle3();
  }
}
void TaskE(void *p){ // producer
  CountE = 0;
	TickType_t xLastWakeTimeE = xTaskGetTickCount();
  while(1){
    CountE++;
    TExaS_Task4();
    Profile_Toggle4();
		xSemaphoreGive(sEF);
    //OS_Sleep(100);  
		vTaskDelayUntil(&xLastWakeTimeE, 100/portTICK_RATE_MS);				
  }
}
void TaskF(void *p){ // consumer
  CountF = 0;
  while(1){
    CountF++;
    //xSemaphoreTake(sEF, (TickType_t)portMAX_DELAY);
		xSemaphoreTake(SwitchTouch, (TickType_t)portMAX_DELAY);
    TExaS_Task5();
    Profile_Toggle5();
  }
}
void TaskG(void *p){ // dummy
  CountG = 0; // this should run a lot
  while(1){
		//xSemaphoreTake(SwitchTouch, (TickType_t)portMAX_DELAY);
    CountG++;
		//TExaS_Task6();
    //Profile_Toggle6();
  }
}
void TaskH(void *p){ // dummy
  CountH = 0; // this one should never run
  while(1){
    CountH++;
  }
}
int main_esk(void){
	BSP_Clock_InitFastest();
	//PLL_Init();
  Profile_Init();  // initialize the 7 hardware profiling pins
	
	sAB = xSemaphoreCreateBinary();
	sCD = xSemaphoreCreateBinary();
	sEF = xSemaphoreCreateBinary();
	xSemaphoreGive(sAB);
	xSemaphoreGive(sCD);
	xSemaphoreGive(sEF);
	
	
	TakeAccelerationData = xSemaphoreCreateBinary();
	TakeSoundData = xSemaphoreCreateBinary();
	xSemaphoreGive(TakeAccelerationData);
	xSemaphoreGive(TakeSoundData);



	xTaskCreate(TaskA, (const char*) "microphone", 128, NULL, 4, NULL);
	xTaskCreate(TaskB, (const char*) "acceleration", 128, NULL, 3, NULL);
	xTaskCreate(TaskC, (const char*) "LCD", 128, NULL, 2, NULL);
	xTaskCreate(TaskD, (const char*) "switch,buzzer", 128, NULL, 1, NULL);
	xTaskCreate(TaskE, (const char*) "LCD", 128, NULL, 1, NULL);
	xTaskCreate(TaskF, (const char*) "switch,buzzer", 128, NULL, 1, NULL);
	xTaskCreate(TaskG, (const char*) "switch,buzzer", 128, NULL, 1, NULL);
	xTaskCreate(TaskH, (const char*) "dummy", 128, NULL, 0, NULL);

	
	BSP_PeriodicTask_InitC(&RealTimeEvents, 1000, 0);
	OS_EdgeTrigger_Init(3);

  TExaS_Init(LOGICANALYZER, 1000); // initialize the Lab 4 grader
	//TExaS_Init(GRADESTEP1, 1000);    // initialize the Lab 4 grader

	// Start RTOS scheduler
  vTaskStartScheduler();
	
	return 0;
}
/* ****************************************** */
/*          End of Step 1 Section             */
/* ****************************************** */












